Autodesk.Revit.DB.Blend.TopProfile
The curves which make up the top profile of the sketch.
Remarks: The indices of the curves in this array match the indices used in the vertex connection map.

Autodesk.Revit.DB.Blend.BottomProfile
The curves which make up the bottom profile of the sketch.
Remarks: The indices of the curves in this array match the indices used in the vertex connection map.

Autodesk.Revit.DB.Blend.SetVertexConnectionMap(Autodesk.Revit.DB.VertexIndexPairArray)
Sets the mapping between the vertices in the top and bottom profiles.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
Thrown when the input argument-"vertexMap"-is null.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Thrown if the input argument-"vertexMap"-is empty.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown when the document failed to regenerate.

Autodesk.Revit.DB.Blend.GetVertexConnectionMap
Gets the mapping between the vertices in the top and bottom profiles.
Remarks: Each vertex refers to the start point of the curve from the top and bottom profiles.

Autodesk.Revit.DB.Blend.TopOffset
The offset of the top end of the blend relative to the sketch plane.

Autodesk.Revit.DB.Blend.BottomOffset
The offset of the bottom end of the blend relative to the sketch plane.

Autodesk.Revit.DB.Blend.BottomSketch
Returns the Bottom Sketch of the Blend.
Remarks: This property is used to retrieve the Bottom Sketch of the Blend.

Autodesk.Revit.DB.Blend.TopSketch
Returns the Top Sketch of the Blend.
Remarks: This property is used to retrieve the Top Sketch of the Blend.

Autodesk.Revit.DB.Blend
A blend solid or void form.